# CannotKeepReferenceOfJoinedElement Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..JoinElementsFailures..::..CannotKeepReferenceOfJoinedElement Property
BuiltInFailures..::..JoinElementsFailures Class See Also
---
Can't keep reference of joined element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotKeepReferenceOfJoinedElement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotKeepReferenceOfJoinedElement As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotKeepReferenceOfJoinedElement {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..JoinElementsFailures Class
Autodesk.Revit.DB Namespace